tests/mutation_sentinels/s4_wrong_connector_name.patch
diff --git a/app/asset_mapper.py b/app/asset_mapper.py
index 7cf59a2..99a851d 100644
--- a/app/asset_mapper.py
+++ b/app/asset_mapper.py
@@ -99,7 +99,7 @@ def map_connection(connection: ConnectionRef) -> Connection:
     # [-1] indexing (same last segment), so they can never be killed by a test
     conn_name: str = _name if _name else conn_qn.rsplit("/", 1)[-1]  # pragma: no mutate
     native: Connection = connection.to_connection()
-    native.connector_name = connection.attributes.connector_name or CONNECTOR_NAME
+    native.connector_name = "mis-attributed"
     native.connection_qualified_name = conn_qn
     native.name = conn_name
     native.category = connection.attributes.category or "API"
